### Simple Data

In [63]:
people = {
    "first": ["Faiq", "Ali", "Momi"],
    "last": ["Ahmad", "Khan", "Khalil"],
    "email": ["faiq@gmail.com", "khan@gmail.com", "khalil@gmail.com"],
}

In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame(people)

In [66]:
df

  first    last             email
0  Faiq   Ahmad    faiq@gmail.com
1   Ali    Khan    khan@gmail.com
2  Momi  Khalil  khalil@gmail.com

In [8]:
df['email']

0      faiq@gmail.com
1      khan@gmail.com
2    khalil@gmail.com
Name: email, dtype: object

In [9]:
#Setting email to be index
df.set_index('email', inplace = True)

In [10]:
#But pandas doesn't do it permenantly
#If you want it permenantly then pass an inplace = true argument in df.set_index
df

                 first    last
email
faiq@gmail.com    Faiq   Ahmad
khan@gmail.com     Ali    Khan
khalil@gmail.com  Momi  Khalil

In [11]:
df.index

Index(['faiq@gmail.com', 'khan@gmail.com', 'khalil@gmail.com'], dtype='object', name='email')

In [12]:
#For Accessing row instead of 0 I will use
df.loc['faiq@gmail.com', 'last']

'Ahmad'

In [13]:
#If you've done it accidently then
df.reset_index(inplace=True)

In [14]:
df

              email first    last
0    faiq@gmail.com  Faiq   Ahmad
1    khan@gmail.com   Ali    Khan
2  khalil@gmail.com  Momi  Khalil

In [15]:
df.loc[1]

email    khan@gmail.com
first               Ali
last               Khan
Name: 1, dtype: object

### Filtering

In [28]:
filt = (df['last'] == 'Khan') | (df['first'] == 'Ali')

In [29]:
df[filt]

            email first  last
1  khan@gmail.com   Ali  Khan

In [31]:
# Can also do with .loc
# ~ for negation
df.loc[filt]
df.loc[~filt, 'last']

0     Ahmad
2    Khalil
Name: last, dtype: object

### Updating Data

In [33]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [35]:
#Updating columns
#Updating all the columns
df.columns = ['first_name', 'last_name', 'email']

In [37]:
df.columns = [x.upper() for x in df.columns]
df

         FIRST_NAME LAST_NAME   EMAIL
0    faiq@gmail.com      Faiq   Ahmad
1    khan@gmail.com       Ali    Khan
2  khalil@gmail.com      Momi  Khalil

In [39]:
df.columns = df.columns.str.replace(' ','_')
df

         FIRST_NAME LAST_NAME   EMAIL
0    faiq@gmail.com      Faiq   Ahmad
1    khan@gmail.com       Ali    Khan
2  khalil@gmail.com      Momi  Khalil

In [43]:
#For changing specific columns
df.rename(columns = {'FIRST_NAME' : 'first', 'LAST_NAME': 'last'}, inplace = True)

In [44]:
df

              first  last   EMAIL
0    faiq@gmail.com  Faiq   Ahmad
1    khan@gmail.com   Ali    Khan
2  khalil@gmail.com  Momi  Khalil

In [45]:
df.rename(columns = {'EMAIL': 'email'}, inplace = True)

In [46]:
df

              first  last   email
0    faiq@gmail.com  Faiq   Ahmad
1    khan@gmail.com   Ali    Khan
2  khalil@gmail.com  Momi  Khalil

In [48]:
#Updating Rows
#But you've to write for all columns
df.loc[2] = ['Nomi', 'Momi', 'nomi@gmail.com']

In [49]:
df

            first  last           email
0  faiq@gmail.com  Faiq           Ahmad
1  khan@gmail.com   Ali            Khan
2            Nomi  Momi  nomi@gmail.com

In [53]:
df.loc[2, ['first', 'last']] = ['Momi', 'Khan']

In [54]:
df

            first  last           email  name
0  faiq@gmail.com  Faiq           Ahmad   NaN
1  khan@gmail.com   Ali            Khan   NaN
2            Momi  Khan  nomi@gmail.com  Khan

In [55]:
df.loc[2, 'last'] = 'Smith'

In [56]:
df

            first   last           email  name
0  faiq@gmail.com   Faiq           Ahmad   NaN
1  khan@gmail.com    Ali            Khan   NaN
2            Momi  Smith  nomi@gmail.com  Khan

In [59]:
#For Single values can also use .at
df.at[2, 'last'] = 'Khan'

In [60]:
df

            first  last           email  name
0  faiq@gmail.com  Faiq           Ahmad   NaN
1  khan@gmail.com   Ali            Khan   NaN
2            Momi  Khan  nomi@gmail.com  Khan

In [67]:
df['email'].str.lower()
df

  first    last             email
0  Faiq   Ahmad    faiq@gmail.com
1   Ali    Khan    khan@gmail.com
2  Momi  Khalil  khalil@gmail.com

In [70]:
# apply (Used when we want to apply on entire data frame or series On Series on each record and on DF on each series/columns)
# map (Only works on series to substitue values of series)
# applymap (Used to apply on each record of df and not on series)s
# replace (To avoid Nan values from maps)
df['email'].apply(len)

0    14
1    14
2    16
Name: email, dtype: int64

In [71]:
def updateEmail(email):
    return email.upper()

In [73]:
df['email'].apply(updateEmail)

0      FAIQ@GMAIL.COM
1      KHAN@GMAIL.COM
2    KHALIL@GMAIL.COM
Name: email, dtype: object

In [74]:
 df['email'] = df['email'].apply(updateEmail)

In [75]:
df

  first    last             email
0  Faiq   Ahmad    FAIQ@GMAIL.COM
1   Ali    Khan    KHAN@GMAIL.COM
2  Momi  Khalil  KHALIL@GMAIL.COM

In [76]:
 df['email'] = df['email'].apply(lambda x:x.lower())

In [77]:
df

  first    last             email
0  Faiq   Ahmad    faiq@gmail.com
1   Ali    Khan    khan@gmail.com
2  Momi  Khalil  khalil@gmail.com

In [78]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [80]:
df.apply(pd.Series.min)

first               Ali
last              Ahmad
email    faiq@gmail.com
dtype: object

In [82]:
df.applymap(len)

   first  last  email
0      4     5     14
1      3     4     14
2      4     6     16

In [83]:
df.applymap(str.lower)

  first    last             email
0  faiq   ahmad    faiq@gmail.com
1   ali    khan    khan@gmail.com
2  momi  khalil  khalil@gmail.com

In [87]:
df['first'].map({'Faiq': 'Khan', 'Momi': 'Nomi'})

0    Khan
1     NaN
2    Nomi
Name: first, dtype: object

In [88]:
df['first'].replace({'Faiq': 'Khan', 'Momi': 'Nomi'})

0    Khan
1     Ali
2    Nomi
Name: first, dtype: object